{"html":"<h2>Renovation Wellness floor</h2>\n<p>Holland’s most famous luxurious retreat, the Amstel Hotel, renovated its Health &amp; Fitness Club. Thereby obtained the prestigious five-star Amsterdam hotel in one go a completely refurbished Wellness floor. The Health &amp; Fitness Club was equipped with the latest innovations in sanitary, including Easy Drain shower channels.</p>\n<p><strong>From classic to modern</strong><img style=\"float: right; margin: 5px;\" title=\"Renovation Wellness floor - Amstel Hotel\" src=\"{{media url=\" wysiwyg=\"\" homepage=\"\" about=\"\" refences=\"\" amstel_hotel-wellness-2013.jpg\"}}\"=\"\" alt=\"Renovation Wellness floor - Amstel Hotel\" width=\"300\"><br> The Amstel Hotel selected the bureau Kamerling Vanderburg Architects for the renovation. They allowed the bureau nine weeks to complete the job. The architect decided to gently break with the classic Amsterdam interior by going for a more modern look. This is reflected in the use of modern materials such as basalt stone and sleek lines.</p>\n<p><strong>Horizontal Shower</strong><br>A Dutch first in this prestigious renovation project is the Horizontal Shower by Dornbracht, a variant of the ATT technique. This unique shower concept offers the possibility to shower while lying under six electronically controlled water jets. Due to its complex shower experience many people regard it as the world’s most relaxing shower experience.</p>\n<p><strong>Challenges</strong><br> Easy Drain’s challenge in this project was to meet the required drainage capacity. Due to the large amount of water produced by the Horizontal Shower. Another challenge was the low installation depth requirements for the renovation. Furthermore, the shower drain had to conform to hygiene and safety standards for guests and personnel.</p>\n<p><strong>No renovation without Easy Drain</strong><br>ESS specially selected the <a title=\"Easy Drain Multi TAF shower drain\" href=\"/en/easy-drain/multi/multi-taf.html\"><strong><span style=\"text-decoration: underline;\">Easy Drain Multi TAF</span></strong></a> for this project. The Multi TAF shower drain seamlessly combines functional and esthetical requirements needed for this renovation. The following features show why this particular drain is very suitable:</p>\n<ul>\n<li>Unique height adjustable drainage siphon.</li>\n<li>Rotatable Zero / tile grate.</li>\n<li>High capacity water trap.</li>\n<li>Minimum installation depth of 80 mm.</li>\n<li>Removable and cleanable water trap.</li>\n<li>360 ° turn able siphon.</li>\n</ul>\n<p><strong>Project information renovation Amstel Hotel Health &amp; Fitness Club:</strong></p>\n<table border=\"0\"></table>"}